Revit 2027 API
LinePatternElement.GetLinePattern(Document, ElementId) Method
 Gets the LinePattern associated to an element or from a built-in line pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static LinePattern GetLinePattern(
	Document document,
	ElementId elementId
)
Public Shared Function GetLinePattern (
	document As Document,
	elementId As ElementId
) As LinePattern
public:
static LinePattern^ GetLinePattern(
	Document^ document,
	ElementId^ elementId
)
static member GetLinePattern :
        document : Document *
        elementId : ElementId -> LinePattern
Parameters
document Document
 The document in which to retrieve the LinePattern.
elementId ElementId
 The ElementId of the LinePatternElement or the built-in line pattern id.
Return Value
LinePattern
 A copy of LinePattern object. null if the ElementId doesn't represent a line pattern element or built-in line pattern. null for Solid.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
LinePatternElement Class
GetLinePattern Overload
Autodesk.Revit.DB Namespace